{
    "skills": [
        {
            "name": "Rust",
            "level": "Intermediate",
            "description": "I have been working with Rust for over 2 years now. I have developed multiple projects using Rust, including writing smart contracts on solana and building web server, which is mentioned in the work experience section."
        },
        {
            "name": "Anchor",
            "level": "Intermediate",
            "description": "I have been working with Anchor for over 2 years now. I have developed multiple projects using Anchor framework, which is mentioned in the work experience section."
        },
        {
            "name": "Solana Web3.js",
            "level": "Advanced",
            "description": "I have been working with Web3.js for over 2 years now. I have worked on multiple things using Web3.js for interacting with smart contracts."
        },
        {
            "name": "JavaScript",
            "level": "Advanced",
            "description": "With over 3 years of Experience in JavaScript, I have developed a strong understanding of the language and its various frameworks. I have worked on multiple projects using JavaScript and have a good understanding of the language."
        },
        {
            "name": "React",
            "level": "Advanced",
            "description": "I have been working with React for over 4 years now. I have developed multiple projects using React and have a good understanding of the framework. I have also worked with Solana web3js and Context API for state management."
        },
        {
            "name": "Node.js",
            "level": "Advanced",
            "description": "I have been working with Node.js for over 3 years now. I have developed multiple projects using Node.js and have a good understanding of the framework. I have also worked with Express.js for building APIs."
        },
        {
            "name": "Express.js",
            "level": "Advanced",
            "description": "I have been working with Express.js framework for over 3 years now. I have developed multiple projects using Express.js. worked with Node.js for building APIs."
        },
        {
            "name": "MongoDB",
            "level": "Advanced",
            "description": "I have been working with MongoDB for over 3 years now. I have developed multiple projects using MongoDB database. I have also worked with Mongoose for building schemas."
        },
        {
            "name": "PostgreSQL",
            "level": "Intermediate",
            "description": "I have been working with PostgreSQL for over 2 years now. I have developed multiple projects using PostgreSQL and have a good understanding of the database. I have also worked with Sequelize for building schemas."
        },
        {
            "name": "TypeScript",
            "level": "Advanced",
            "description": "I have been working with TypeScript for over 2 years now. I have developed multiple projects using TypeScript and have a good understanding of the language."
        },
        {
            "name": "CSS",
            "level": "Advanced",
            "description": "I have been working with CSS for over 4 years now. I have developed multiple projects using CSS and have a good understanding of the language."
        },
        {
            "name": "Tailwind CSS",
            "level": "Advanced",
            "description": "I have been working with Tailwind CSS for over 2 years now. I have developed multiple projects using Tailwind CSS and have a good understanding of the framework."
        }
    ],
    "workExperience": [
        {
            "company": "GooseFx Labs",
            "position": "Full Stack Developer",
            "startDate": "March 2022",
            "endDate": "July 2024",
            "projects": [
                "Developed and executing an automated token buy-back and burn system utilizing Jupiter CPI and Rust, thereby boosting token value through the reduction of its supply via secure market purchases and burns.",
                "Implementing transparency measures by regularly updating the community via Twitter, fostering trust among stakeholders through transparent and automated tweets.",
                "Engineering a cutting-edge revenue-sharing smart contract on the Solana blockchain using Rust, streamlining profit distribution among stakeholders with automation and transparency.",
                "Developed the UI of a single sided liquidity automated market maker (SSL AMM), including seamless integration with Solana Web3 libraries to ensure real-time synchronisation with the Solana blockchain, overseeing a Total Value Locked (TVL) of $20 million & trading volume exceeding $700 million.",
                "Enabling users to engage in yield farming with a single asset on GooseFX, allowing them to earn stake rewards, showcasing expertise in decentralised finance (DeFi).",
                "Developed an end-to-end leaderboard system for perpetual contract users, including reading on-chain data, storing it in a database, and exposing the data through an API for ranking users based on trading volume on the platform."
            ],
            "description": "Description 1"
        },
        {
            "company": "Citrix R&D",
            "position": "Position 2",
            "startDate": "July 2020",
            "endDate": "March 2022",
            "projects": [
                "Enhanced user experience of Director Trends Pages by improving keyboard and audio  interactions, ensuring compliance with 508 standards.",
                "Integrated CASP into Director, resulting in a 20% increase in active usage of the CASP product in the US region and a 33% increase in the EU region.",
                "Took ownership of bug fix PI and personally reduced 18% of the bugs in Director UI, improving overall system stability and user satisfaction.",
                "Applied knowledge of WAI-ARIA concepts to optimize accessibility features, improving usability for users with special abilities."
            ],
            "description": "Description 2"
        }
    ]
}